app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "Michael"], ["body", "Bad comment"], ["article_id", 4], ["created_at", "2016-06-19 22:43:56.046892"], ["updated_at", "2016-06-19 22:43:56.046892"]]